###################################################################

# Created by write_sdc on Tue Dec 22 11:45:50 2020

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {OUT_PC[31]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[30]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[29]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[28]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[27]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[26]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[25]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[24]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[23]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[22]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[21]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[20]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[19]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[18]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[17]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[16]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[15]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[14]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[13]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[12]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[11]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[10]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[9]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[8]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[7]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[6]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[5]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[4]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[3]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[2]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[1]}]
set_load -pin_load 3.40189 [get_ports {OUT_PC[0]}]
set_load -pin_load 3.40189 [get_ports MEM_RD_ENABLE]
set_load -pin_load 3.40189 [get_ports MEM_WR_ENABLE]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[31]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[30]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[29]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[28]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[27]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[26]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[25]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[24]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[23]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[22]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[21]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[20]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[19]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[18]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[17]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[16]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[15]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[14]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[13]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[12]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[11]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[10]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[9]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[8]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[7]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[6]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[5]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[4]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[3]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[2]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[1]}]
set_load -pin_load 3.40189 [get_ports {DATA_MEM_ADDRESS[0]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[31]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[30]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[29]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[28]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[27]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[26]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[25]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[24]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[23]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[22]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[21]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[20]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[19]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[18]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[17]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[16]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[15]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[14]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[13]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[12]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[11]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[10]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[9]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[8]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[7]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[6]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[5]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[4]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[3]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[2]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[1]}]
set_load -pin_load 3.40189 [get_ports {WR_DATA[0]}]
create_clock [get_ports CLOCK]  -name MY_CLK  -period 3.95  -waveform {0 1.975}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {READ_DATA[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports RESET_N]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT_PC[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports MEM_RD_ENABLE]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports MEM_WR_ENABLE]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_MEM_ADDRESS[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {WR_DATA[0]}]
